app/controllers/features_controller.rb

SELECT * FROM `features`
---
  def index
    @features = Feature.all

SELECT * FROM `features` WHERE (`features`.`id` = 953125641)
---
  def show
    @feature = Feature.find(params[:id])

SELECT * FROM `features` WHERE (`features`.`id` = 953125641)
---
  def edit
    @feature = Feature.find(params[:id])

INSERT INTO `features` (`status`, `iteration`, `acceptanceCriteria`, `size`, `category`, `updated_at`, `title`, `priority`, `doneDate`, `description`, `release`, `created_at`) VALUES(NULL, NULL, NULL, NULL, NULL, '2009-06-10 23:14:05', NULL, NULL, NULL, NULL, NULL, '2009-06-10 23:14:05')
---
  def create
    @feature = Feature.new(params[:feature])

    respond_to do |format|
      if @feature.save

SELECT * FROM `features` WHERE (`features`.`id` = 953125641)
---
  def update
    @feature = Feature.find(params[:id])

SELECT * FROM `features` WHERE (`features`.`id` = 953125641)
DELETE FROM `features` WHERE `id` = 953125641
---
  def destroy
    @feature = Feature.find(params[:id])
    @feature.destroy